package cn.cerc.core;

import org.junit.Test;

import junit.framework.TestCase;

public class DataSetTest extends TestCase {

    @Test
    public void test_list() {
        DataSet ds = new DataSet();
        ds.append();
        ds.setField("A", "A01");
        ds.setField("B", "B01");
        ds.append();
        ds.setField("A", "A02");
        ds.setField("B", "B02");
        ds.append();
        ds.setField("A", "A03");
        ds.setField("B", "B03");

        int i = 0;
        for (@SuppressWarnings("unused")
                Record record : ds) {
            i++;
        }
        assertEquals(i, ds.size());
    }

    @Test
    public void test_delete_a() {
        DataSet ds = new DataSet();
        ds.append().setField("code", "a");
        ds.append().setField("code", "b");
        ds.append().setField("code", "c");

        int i = 0;
        ds.first();
        while (!ds.eof()) {
            i++;
            if (ds.getString("code").equals("a"))
                ds.delete();
            else
                ds.next();
        }
        assertEquals(i, 3);
    }

    @Test
    public void test_delete_b() {
        DataSet ds = new DataSet();
        ds.append().setField("code", "a");
        ds.append().setField("code", "b");
        ds.append().setField("code", "c");

        int i = 0;
        ds.first();
        while (!ds.eof()) {
            i++;
            if (ds.getString("code").equals("b"))
                ds.delete();
            else
                ds.next();
        }
        assertEquals(i, 3);
    }

    @Test
    public void test_delete_c() {
        DataSet ds = new DataSet();
        ds.append().setField("code", "a");
        ds.append().setField("code", "b");
        ds.append().setField("code", "c");

        int i = 0;
        ds.first();
        while (!ds.eof()) {
            i++;
            if (ds.getString("code").equals("c"))
                ds.delete();
            else
                ds.next();
        }
        assertEquals(i, 3);
    }

    @Test
    public void test_toJSON() {
        DataSet ds = new DataSet();
        String jsonStr = "{\"head\":{\"It\":1,\"TBNo\":\"OD001\"},"
                + "\"body\":[[\"It\",\"Part\",\"Desc\"],[1,\"001\",\"desc\"],[2,\"001\",\"desc\"]]}";
        Record head = ds.getHead();
        head.setField("It", 1);
        head.setField("TBNo", "OD001");
        ds.append();
        ds.setField("It", 1);
        ds.setField("Part", "001");
        ds.setField("Desc", "desc");
        ds.append();
        ds.setField("It", 2);
        ds.setField("Part", "001");
        ds.setField("Desc", "desc");
        assertEquals(jsonStr, ds.toString());
    }

    @Test
    public void test_fromJSON() {
        String jsonStr = "{\"head\":{\"It\":1,\"TBNo\":\"OD001\"},"
                + "\"body\":[[\"It\",\"Part\",\"Desc\"],[1,\"001\",\"desc\"],[2,\"001\",\"desc\"]]}";
        DataSet ds = new DataSet().fromJson(jsonStr);
        assertEquals(jsonStr, ds.toString());
        assertEquals("1", ds.getHead().getString("It"));
    }

    /**
     * 小数点测试
     */
    @Test
    public void test_1() {
        String json = "{\"head\":{\"Discount_\":0.91,\"MaxCouponAmount_\":-1},\"body\":[[\"PartCode_\",\"Desc_\",\"Spec_\",\"Unit_\"],[\"21CJ7H1009-1\",\"鲇竿,长江七号,10091\",\"专卖,碳素,40T,565g,1009,OFF.CC\",\"PCS\"],[\"21CJ7H1110-1\",\"鲇竿,长江七号,11101\",\"专卖,碳素,40T,665g,1110,OFF.CC\",\"PCS\"],[\"21CJ7H1210-1\",\"鲇竿,长江七号,1210\",\"专卖,碳素,40T,720g,1210,OFF.CC\",\"PCS\"],[\"21CJ7H9008-1\",\"鲇竿,长江七号,90081\",\"专卖,碳素,40T,450g,9008,OFF.CC\",\"PCS\"],[\"21ADF4505-1\",\"鼎风,4501\",\"专卖\\u0027碳素,40T,127g,4501\",\"PCS\"]]}";
        DataSet dataSet = new DataSet().fromJson(json);
        assertEquals(json, dataSet.toString());
        assertTrue(dataSet.getHead().hasValue("Discount_"));
        assertEquals("0.91", dataSet.getHead().getString("Discount_"));
        assertEquals(0, dataSet.getHead().getInt("Discount_"));
    }

    /**
     * 整数测试
     */
    @Test
    public void test_2() {
        String json = "{\"head\":{\"Discount_\":1,\"MaxCouponAmount_\":-1},\"dataset\":[[\"PartCode_\",\"Desc_\",\"Spec_\",\"Unit_\"],[\"21CJ7H1009-1\",\"鲇竿,长江七号,10091\",\"专卖,碳素,40T,565g,1009,OFF.CC\",\"PCS\"],[\"21CJ7H1110-1\",\"鲇竿,长江七号,11101\",\"专卖,碳素,40T,665g,1110,OFF.CC\",\"PCS\"],[\"21CJ7H1210-1\",\"鲇竿,长江七号,1210\",\"专卖,碳素,40T,720g,1210,OFF.CC\",\"PCS\"],[\"21CJ7H9008-1\",\"鲇竿,长江七号,90081\",\"专卖,碳素,40T,450g,9008,OFF.CC\",\"PCS\"],[\"21ADF4505-1\",\"鼎风,4501\",\"专卖\\u0027碳素,40T,127g,4501\",\"PCS\"]]}";
        DataSet dataSet = new DataSet().fromJson(json);
        assertTrue(dataSet.getHead().hasValue("Discount_"));
        assertEquals("1", dataSet.getHead().getString("Discount_"));
        assertEquals(1, dataSet.getHead().getInt("Discount_"));
    }

    public void test_kashi() {
        String json = "{\"body\":[[\"corpId_\",\"corpName_\",\"v1_\",\"v2_\",\"tbDate_\"],[388,\"城区第一供电中心\",\"100\",\"15\",\"2021-01-31\"],[389,\"城区第二供电中心\",\"100\",\"15\",\"2021-01-31\"],[390,\"城区第三供电中心\",\"100\",\"15\",\"2021-01-31\"],[391,\"五家渠市供电公司\",\"100\",\"15\",\"2021-01-31\"],[392,\"西郊供电公司\",\"100\",\"15\",\"2021-01-31\"],[394,\"新湖供电公司\",\"100\",\"15\",\"2021-01-31\"],[395,\"吉木萨尔县供电公司\",\"100\",\"15\",\"2021-01-31\"],[396,\"阜康市供电公司\",\"100\",\"15\",\"2021-01-31\"],[397,\"准东经济技术开发区供电公司\",\"100\",\"15\",\"2021-01-31\"],[399,\"托克逊县供电公司\",\"100\",\"15\",\"2021-01-31\"],[401,\"城区供电中心\",\"93.577236\",\"14.036585\",\"2021-01-31\"],[401,\"城区供电中心\",\"93.990886\",\"14.098633\",\"2021-01-31\"],[401,\"城区供电中心\",\"99.416807\",\"14.912521\",\"2021-01-31\"],[401,\"城区供电中心\",\"98.121732\",\"14.71826\",\"2021-01-31\"],[401,\"城区供电中心\",\"96.945705\",\"14.541856\",\"2021-01-31\"],[401,\"城区供电中心\",\"98.136181\",\"14.720427\",\"2021-01-31\"],[401,\"城区供电中心\",\"91.333333\",\"13.7\",\"2021-01-31\"],[401,\"城区供电中心\",\"100\",\"15\",\"2021-01-31\"],[401,\"城区供电中心\",\"91.499144\",\"13.724872\",\"2021-01-31\"],[403,\"阿拉山口市供电公司\",\"100\",\"15\",\"2021-01-31\"],[405,\"尼勒克县供电公司\",\"100\",\"15\",\"2021-01-31\"],[406,\"巩留县供电公司\",\"100\",\"15\",\"2021-01-31\"],[408,\"吉木乃县供电公司\",\"100\",\"15\",\"2021-01-31\"],[409,\"北屯供电公司\",\"100\",\"15\",\"2021-01-31\"],[410,\"青河县供电公司\",\"100\",\"15\",\"2021-01-31\"],[412,\"托里县供电公司\",\"100\",\"15\",\"2021-01-31\"],[413,\"和布克赛尔县供电公司\",\"100\",\"15\",\"2021-01-31\"],[415,\"尉犁县供电公司\",\"100\",\"15\",\"2021-01-31\"],[416,\"和静县供电公司\",\"100\",\"15\",\"2021-01-31\"],[417,\"和硕县供电公司\",\"100\",\"15\",\"2021-01-31\"],[418,\"博湖县供电公司\",\"100\",\"15\",\"2021-01-31\"],[419,\"且末县供电公司\",\"100\",\"15\",\"2021-01-31\"],[421,\"柯坪县供电公司\",\"100\",\"15\",\"2021-01-31\"],[422,\"奇台县供电公司\",\"99.125454\",\"14.868818\",\"2021-01-31\"],[423,\"木垒县供电公司\",\"100\",\"15\",\"2021-01-31\"],[425,\"巴里坤县供电公司\",\"100\",\"15\",\"2021-01-31\"],[426,\"沙雅县供电公司\",\"100\",\"15\",\"2021-01-31\"],[427,\"温泉县供电公司\",\"100\",\"15\",\"2021-01-31\"],[428,\"伊吾县供电公司\",\"99.263627\",\"14.889544\",\"2021-01-31\"],[429,\"霍城县供电公司\",\"100\",\"15\",\"2021-01-31\"],[430,\"库车县供电公司\",\"98.036701\",\"14.705505\",\"2021-01-31\"],[431,\"独山子区供电公司\",\"100\",\"15\",\"2021-01-31\"],[432,\"霍尔果斯市供电公司\",\"100\",\"15\",\"2021-01-31\"],[434,\"阿克陶县供电公司\",\"100\",\"15\",\"2021-01-31\"],[435,\"哈巴河县供电公司\",\"92.785948\",\"13.917892\",\"2021-01-31\"],[436,\"特克斯县供电公司\",\"100\",\"15\",\"2021-01-31\"],[437,\"米东区供电公司\",\"96\",\"14.4\",\"2021-01-31\"],[438,\"乌鲁木齐县供电公司\",\"100\",\"15\",\"2021-01-31\"],[439,\"富蕴县供电公司\",\"91.333333\",\"13.7\",\"2021-01-31\"],[440,\"若羌县供电公司\",\"91.333333\",\"13.7\",\"2021-01-31\"],[441,\"阿合奇县供电公司\",\"91.333333\",\"13.7\",\"2021-01-31\"],[442,\"精河县供电公司\",\"95.474742\",\"14.321211\",\"2021-01-31\"],[443,\"鄯善县供电公司\",\"100\",\"15\",\"2021-01-31\"],[444,\"乌苏市供电公司\",\"86.666667\",\"13\",\"2021-01-31\"],[446,\"策勒县供电公司\",\"100\",\"15\",\"2021-01-31\"],[448,\"疏勒县供电公司\",\"100\",\"15\",\"2021-01-31\"],[449,\"泽普县供电公司\",\"100\",\"15\",\"2021-01-31\"],[450,\"塔什库尔干县供电公司\",\"100\",\"15\",\"2021-01-31\"],[451,\"麦盖提县供电公司\",\"99.699433\",\"14.954915\",\"2021-01-31\"],[452,\"于田县供电公司\",\"95.253323\",\"14.287998\",\"2021-01-31\"],[453,\"莎车县供电公司\",\"99.890059\",\"14.983509\",\"2021-01-31\"],[454,\"民丰县供电公司\",\"91.333333\",\"13.7\",\"2021-01-31\"],[455,\"疏附县供电公司\",\"91.333333\",\"13.7\",\"2021-01-31\"],[456,\"察布查尔县供电公司\",\"83.871631\",\"12.580745\",\"2021-01-31\"],[457,\"轮台县供电公司\",\"98.675938\",\"14.801391\",\"2021-01-31\"],[458,\"皮山县供电公司\",\"100\",\"15\",\"2021-01-31\"],[459,\"沙湾县供电公司\",\"100\",\"15\",\"2021-01-31\"],[460,\"乌恰县供电公司\",\"100\",\"15\",\"2021-01-31\"],[461,\"墨玉县供电公司\",\"91.333333\",\"13.7\",\"2021-01-31\"],[462,\"阿瓦提县供电公司\",\"92.13643\",\"13.820465\",\"2021-01-31\"],[463,\"岳普湖县供电公司\",\"100\",\"15\",\"2021-01-31\"],[464,\"呼图壁县供电公司\",\"100\",\"15\",\"2021-01-31\"],[465,\"芳草湖供电公司\",\"100\",\"15\",\"2021-01-31\"],[466,\"昭苏县供电公司\",\"100\",\"15\",\"2021-01-31\"],[467,\"布尔津县供电公司\",\"100\",\"15\",\"2021-01-31\"],[468,\"额敏县供电公司\",\"91.3333\",\"13.699995\",\"2021-01-31\"],[469,\"玛纳斯县供电公司\",\"99.408908\",\"14.911336\",\"2021-01-31\"],[470,\"英吉沙县供电公司\",\"94.939532\",\"14.24093\",\"2021-01-31\"],[471,\"裕民县供电公司\",\"92.173625\",\"13.826044\",\"2021-01-31\"],[472,\"新和县供电公司\",\"100\",\"15\",\"2021-01-31\"],[473,\"拜城县供电公司\",\"100\",\"15\",\"2021-01-31\"],[474,\"福海县供电公司\",\"98.502048\",\"14.775307\",\"2021-01-31\"],[475,\"洛浦县供电公司\",\"91.333333\",\"13.7\",\"2021-01-31\"],[476,\"乌什县供电公司\",\"97.648852\",\"14.647328\",\"2021-01-31\"],[477,\"温宿县供电公司\",\"97.487284\",\"14.623093\",\"2021-01-31\"],[478,\"焉耆县供电公司\",\"91.111111\",\"13.666667\",\"2021-01-31\"],[479,\"和田县供电公司\",\"100\",\"15\",\"2021-01-31\"],[480,\"阿图什市供电公司\",\"92.794945\",\"13.919242\",\"2021-01-31\"],[481,\"新源县供电公司\",\"93.333333\",\"14\",\"2021-01-31\"],[482,\"伽师县供电公司\",\"95.499652\",\"14.324948\",\"2021-01-31\"],[483,\"伊宁县供电公司\",\"91.333333\",\"13.7\",\"2021-01-31\"],[484,\"巴楚县供电公司\",\"91.333333\",\"13.7\",\"2021-01-31\"],[485,\"叶城县供电公司\",\"89.639046\",\"13.445857\",\"2021-01-31\"]]}";
        System.out.println(json);
        DataSet dataSet = new DataSet();
        dataSet.fromJson(json);

        Record head = dataSet.getHead();
        head.setField("timestamp", System.currentTimeMillis());
        head.setField("success", true);
        head.setField("message", "操作成功！");
        head.setField("code", 200);

        buildField(dataSet.getHead().getFieldDefs());

        dataSet.first();
        while (dataSet.fetch()) {
            dataSet.setField("it_", dataSet.getRecNo());
        }
        buildField(dataSet.getFieldDefs());

        dataSet.buildMeta().setMetaInfo(true);
        System.out.println(dataSet.toJson());
        System.out.println(json.equals(dataSet.toJson()));
        dataSet.first();
//        while(dataSet.fetch()){
//            System.out.println(dataSet.getString("v2_"));
//        }
    }

    private void buildField(FieldDefs defs) {
        for (FieldMeta meta : defs) {
            System.out.println(meta.getCode());
            switch (meta.getCode()) {
                // head
                case "timestamp":
                    meta.setName("时间戳");
                    break;
                case "success":
                    meta.setName("成功与否");
                    break;
                case "message":
                    meta.setName("消息提示");
                    break;
                case "code":
                    meta.setName("状态码");
                    break;
                // body
                case "it_":
                    meta.setName("序");
                    break;
                case "corpId_":
                    meta.setName("单位编号");
                    break;
                case "corpName_":
                    meta.setName("单位名称");
                    break;
                case "v1_":
                    meta.setName("指标_完成值");
                    break;
                case "v2_":
                    meta.setName("得分_(15分)");
                    break;
                case "tbDate_":
                    meta.setName("统计日期");
                    break;
                default:
                    break;
            }
        }
    }

}